---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotKeepVariabilityOfRebarInGroup
source: html/8b0e0ba1-769d-9025-0368-73a63f0c9899.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotKeepVariabilityOfRebarInGroup Property

Modifications to the rebar set might cause it to revert to a uniform distribution. This can occur for layout changes as well as modifications to the geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotKeepVariabilityOfRebarInGroup { get; }
```